e03/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ro" xml:lang="ro">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lucrul cu formularele</title>
<meta name="author" content="Petru Rebeja" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Lucrul cu formularele</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Cuprins</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgff2dd47">Resurse</a>
<ul>
<li><a href="#org8cb5939">index.php</a></li>
<li><a href="#org055b5b2">register-feedback.php</a></li>
<li><a href="#orgd9b0dfe">styles.css</a></li>
<li><a href="#orgcca3322">Docker</a></li>
</ul>
</li>
<li><a href="#orgc8ac627">Cerințe</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgff2dd47" class="outline-2">
<h2 id="orgff2dd47">Resurse</h2>
<div class="outline-text-2" id="text-orgff2dd47">
</div>
<div id="outline-container-org8cb5939" class="outline-3">
<h3 id="org8cb5939">index.php</h3>
<div class="outline-text-3" id="text-org8cb5939">
<p>
Salvați codul-sursă de mai jos într-un fișier numit <code>index.php</code>.
</p>

<div class="org-src-container">
<pre class="src src-php">&lt;!<span style="color: #4271ae;">DOCTYPE</span> html&gt;
&lt;html lang=<span style="color: #3e999f;">"ro"</span>&gt;
&lt;head&gt;
    &lt;meta charset=<span style="color: #3e999f;">"UTF-8"</span>&gt;
    &lt;meta name=<span style="color: #3e999f;">"viewport"</span> content=<span style="color: #3e999f;">"width=device-width, initial-scale=1.0"</span>&gt;
    &lt;title&gt;Oale &#537;i ulcele&lt;/title&gt;
    &lt;link rel=<span style="color: #3e999f;">"stylesheet"</span> href=<span style="color: #3e999f;">"styles.css"</span>&gt;
&lt;/head&gt;
&lt;body&gt;
    &lt;header&gt;
        &lt;nav&gt;
            &lt;ul&gt;
                &lt;li&gt;&lt;a href=<span style="color: #3e999f;">"#"</span>&gt;Pagina principal&#259;&lt;/a&gt;&lt;/li&gt;
                &lt;li&gt;&lt;a href=<span style="color: #3e999f;">"#"</span>&gt;Despre noi&lt;/a&gt;&lt;/li&gt;
                &lt;li&gt;&lt;a href=<span style="color: #3e999f;">"#"</span>&gt;Servicii&lt;/a&gt;&lt;/li&gt;
                &lt;li&gt;&lt;a href=<span style="color: #3e999f;">"#"</span>&gt;Contact&lt;/a&gt;&lt;/li&gt;
            &lt;/ul&gt;
        &lt;/nav&gt;
    &lt;/header&gt;

    &lt;main&gt;

    &lt;/main&gt;
    &lt;footer&gt;
        &lt;p&gt;Contact us at: deschide@oalesiulcele.ro&lt;/p&gt;
    &lt;/footer&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org055b5b2" class="outline-3">
<h3 id="org055b5b2">register-feedback.php</h3>
<div class="outline-text-3" id="text-org055b5b2">
<p>
Salvați codul-sursă de mai jos într-un fișier numit <code>register-feedback.php</code>.
</p>

<div class="org-src-container">
<pre class="src src-php"><span style="color: #8959a8;">&lt;?php</span>
<span style="color: #718c00;">echo</span> <span style="color: #3e999f;">"Implement me..."</span>
<span style="color: #8959a8;">?&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd9b0dfe" class="outline-3">
<h3 id="orgd9b0dfe">styles.css</h3>
<div class="outline-text-3" id="text-orgd9b0dfe">
<p>
Salvați codul-sursă de mai jos într-un fișier numit <code>styles.css</code> sau creați propiile stiluri.
</p>

<div class="org-src-container">
<pre class="src src-css"><span style="color: #f5871f;">*</span> {
     <span style="color: #718c00;">margin</span>: 0;
     <span style="color: #718c00;">padding</span>: 0;
     <span style="color: #718c00;">box-sizing</span>: border-box;
 }

 <span style="color: #f5871f;">body</span> {
     <span style="color: #718c00;">font-family</span>: Arial, sans-serif;
     <span style="color: #718c00;">line-height</span>: 1.6;
 }

 <span style="color: #f5871f;">header</span> {
     <span style="color: #718c00;">background-color</span>: <span style="color: #000000; background-color: #00ccff;">#00ccff</span>;
     <span style="color: #718c00;">color</span>: <span style="color: #000000; background-color: #fff;">#fff</span>;
     <span style="color: #718c00;">padding</span>: 1rem 0;
 }

 <span style="color: #f5871f;">nav ul</span> {
     <span style="color: #718c00;">list-style</span>: none;
     <span style="color: #718c00;">display</span>: flex;
     <span style="color: #718c00;">justify-content</span>: center;
 }

 <span style="color: #f5871f;">nav ul li</span> {
     <span style="color: #718c00;">margin</span>: 0 1rem;
 }

 <span style="color: #f5871f;">nav ul li a</span> {
     <span style="color: #718c00;">color</span>: <span style="color: #000000; background-color: #ffffff;">#ffffff</span>;
     <span style="color: #718c00;">text-decoration</span>: none;
 }


 <span style="color: #f5871f;">footer</span> {
     <span style="color: #718c00;">background-color</span>: <span style="color: #000000; background-color: #00ccff;">#00ccff</span>;
     <span style="color: #718c00;">color</span>: <span style="color: #000000; background-color: #fff;">#fff</span>;
     <span style="color: #718c00;">text-align</span>: center;
     <span style="color: #718c00;">padding</span>: 1rem 0;
 }

 <span style="color: #8959a8;">@media</span> screen and (max-width: 449px){
     <span style="color: #f5871f;">nav ul</span> {
         <span style="color: #718c00;">flex-direction</span>: column;
         <span style="color: #718c00;">text-align</span>: center;
     }
 }

 <span style="color: #8959a8;">@media</span> screen and (min-width: 768px){
     <span style="color: #f5871f;">.cards</span> {
         <span style="color: #718c00;">flex-direction</span>: row;
         <span style="color: #718c00;">align-items</span>: center;
     }
 }
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcca3322" class="outline-3">
<h3 id="orgcca3322">Docker</h3>
<div class="outline-text-3" id="text-orgcca3322">
<p>
Pentru a rula codul folosind o imagine <code>Docker</code>, mai întâi navigați în directorul în care ați salvat fișierele de mai sus și rulați comanda următoare:
</p>

<div class="org-src-container">
<pre class="src src-shell">docker run -d -p 8081:80 --name lab-tw -v <span style="color: #3e999f;">"$PWD"</span>:/var/www/html php:8.2-apache
</pre>
</div>

<p>
La sfârșit, opriți containerul folosind comanda = docker stop lab-tw=. Pentru a elimina containerul executați comanda <code>docker rm lab-tw</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc8ac627" class="outline-2">
<h2 id="orgc8ac627">Cerințe</h2>
<div class="outline-text-2" id="text-orgc8ac627">
<ul class="org-ul">
<li>Adăugați un formular de feedback în pagină cu următoarele câmpuri: nume și mesaj.</li>
<li>Implementați validarea datelor în <code>register-feedback.php</code></li>
<li>Dacă datele sunt valide, redirecționați clientul către <code>index.php</code></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Petru Rebeja</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
